{
  "products": [
    {
      "id": "001",
      "image": "book1.jpeg",
      "name": "Роберт Мартин 'Чистый код'",
      "author": "Роберт Мартин ",
      "price": 2100.234234234,
      "article": "Если ваш код работает, это ещё не значит, что его можно назвать хорошим. Эта книга по программированию расскажет вам не только о том, как писать хороший код, но и как превратить плохой код в хороший. С её помощью вы сможете понять, почему такие мелочи, как правильное название переменных, - вовсе даже не мелочи, а важные пункты на пути к осознанию того, как писать 'чистый код'.",
      "available": true
    },
    {
      "id": "002",
      "image": "book2.jpg",
      "name": " 'Язык программирования C++. Базовый курс'",
      "author": "Стенли Б. Липпман, Жози Лажойе, Барбара Э. Му",
      "price": 3150.12312412,
      "article": "Это популярное введение в стандарт C++ было полностью обновлено, реорганизовано и переписано, чтобы помочь программистам быстрее изучить язык и использовать его более современным, эффективным способом. Со времён последнего издания подход авторов к обучению языку развивался вместе с языком. Теперь книга предоставляет читателям средства для написания полезных программ без предварительной обработки каждой детали языка.",
      "available": true
    },
    {
      "id": "003",
      "image": "book3.jpg",
      "name": " 'Язык программирования С'",
      "author": "Брайан Керниган, Деннис Ритчи",
      "price": 4200.51524,
      "article": "`Книга по программированию от авторов языка C. В своё время она стала своеобразным классическим учебником по языку С и до сих пор является классикой для всех изучающих и/или использующих как С, так и С++. На текущий момент книга переиздана уже в третий раз с учётом всех поправок и изменений в терминологии за прошедшее время.`",
      "available": false
    },
    {
      "id": "004",
      "image": "book4.jpg",
      "name": " 'Java. Эффективное программирование'",
      "author": "Джошуа Блох",
      "price": 5300.1245512,
      "article": "Здесь есть 57 ценных правил, которые помогут понять, как именно нужно работать с языком Java, чтобы получить надежный, эффективный и понятный всем программный код. Каждое из приведенных правил представлено в форме короткого эссе, в которое включены описание проблемы, код (пример), а также случаи из личного опыта автора.",
      "available": true
    },
    {
      "id": "005",
      "image": "book5.jpg",
      "name": "'Изучаем Java'",
      "author": "Кэти Сьерра и Берт Бейтс",
      "price": 6500.3522314,
      "article": "T5",
      "available": false
    },
    {
      "id": "006",
      "image": "book6.jpg",
      "name": "'Алгоритмы: построение и анализ'",
      "author": "Томас Кормен, Чарльз Лейзерсон, Рональд Ривест и Клиффорд Штайн ",
      "price": 8700.4124123,
      "article": "Эта книга подойдёт для тех, кому наскучили обыкновенные абзацы с текстом. Данная книга предоставляет информацию читателю в визуальном формате. Во время её прочтения вам будет казаться, что её для вас написал ваш друг, а не какой-то учёный, который использует кучу непонятных слов. В книге приведена вся нужная теория, которая также подкрепляется практическими примерами и тестами.",
      "available": true
    }
  ]
}
